package LangDat;
require Exporter;
use strict;
use utf8;
use encoding 'utf8';

our @ISA                = qw(Exporter);
our @EXPORT             = qw( getconfig ); 

our %kanji_data = (
    日 => {			# １９１５
	音 => {
	    ニチ => [qw(日夜 日中 毎日 今日 一日 日本 土日)],
	    ジツ => [qw(本日 平日 日月)],
	},
	訓 => {
	    ひ => [qw(日時計 日の出 日の入り 朝日 日々 日に日に)],
	    ーび => [qw(日曜日 誕生日)],
	    ーか =>  [qw(三日前 十月十日)],
	    },
	義 => {
	    0 => [qw(今日 一日 明日 昨日)], # 義訓（ぎくん）
	},
	英 => [qw(day sun Japan)],
    },
    木 => {			# ２１４９
	音 => {
	    ボク => [qw(木石 香木 原木)],
	    モク => [qw(草木 木材 木造の)],
	},
	訓 => {
	    き => [qw(植木 苗木 木登り 木彫り 白木)],
	    ーこ => [qw(木陰 木立)],
	},
	義 => {
	    0 => [qw(木綿)],
	},
	英 => [qw(tree wood)],
    },
    本 => {			# ２１８３
	音 => {
	    ホン => [qw(日本 本国 本来 見本 手本 本屋 読本 本日 本年 本土 本当に 本名 八本の鉛筆)],
	},
	訓 => {
	    もと => [qw(国の本 一本の草)],
	},
	義 => { 
	    0 => [qw()], 
	},
	英 => [qw(basis book this)],
    },
    末 => {			# ２１８４
	音 => {
	    マツ => [qw(末尾 年末 週末 結末 末日 本末 末端 粉末 月末 末期 末期的)],
	    バツ => [qw(末弟 末流)],
	},
	訓 => {
	    すえ => [qw(三月の末 末っ子 末に 末の末 末々)],
	},
	義 => {
	    0 => [qw(末枯れ 末若い 末葉)],
	},
	英 => ["last part"],
    },
    未 => {			# ２１８５
	音 => {
	    ミ => [qw(未来 未知の 未定の 前代未聞の)],
	},
	訓 => {
	    "いま·だ" => [qw(未だ嘗て無偉大な人)],
	    "ま·だ" => [qw(彼は未だ来ていない)],
	},
	義 => { 
	    0 => [qw()], 
	},
	英 => ["not yet"],
    },
    零 => {			# １７８６
	音 => {
	    レイ => [qw(零下 零時 零点 零細)],
	},
	訓 => {
	    "こぼ·す" => [qw(落ち零れ 零す 取零す 零れる)],
	},
	義 => {
	    0 => [qw(零戦)],
	},
	英 => [qw(zero)],
    },
    );

our %word_data = (
    日夜 => {
	平仮名 => [qw(にちや)],
	英 => {
	    0 => ["day and night"],
	},
	例 => {
	    一 => {
	       日 => "看護婦達は、日夜患者の世話を為た。",
	       平 => "かんごふたちは、にちやかんじゃのせわおした。",
	       英 => "The nurses attend to the patient day and night.",
	    },
	    二 => {
	       日 => "彼は金持ちになる為に、日夜働いた。",
	       平 => "かれはかねもちになるために、にちやはたらいた。",
	       英 => "He worked day and night so that he might become rich.",
	    },
	    三 => {
	       日 => "私は昨日夜遅く迄起きていた。",
	       平 => "わたしはさくじつ（きのう）よるおそくまでおきていた。",
	       英 => "I stayed up late last night.",
	    },
	},
    },
    日中 => {
	平仮名 => [qw(にっちゅう)],
	英 => {
	    0 => ["during the day"],
	},
	例 => {
	    一 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	    二 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	},
    },
    毎日 => {
	平仮名 => [qw(まいにち)],
	英 => {
	    0 => ["every day"],
	},
	例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	},
    },
    今日 => {
	平仮名 => [qw(こんにち)],
	英 => {
	    1 => ["today", "this day"],
	    2 => ["these days","recently","nowadays"],
	},
	例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	},
    },
    一日 => {
	平仮名 => [qw(いちにち いちじつ ついたち つきたち いっぴ)],
	英 => {
	    1 => ["first day of the month (いっぴ's only meaning)"],
	    2 => ["one day (いちにち、いちじつ)"],
	    3 => ["first 10 days of the lunar month (つきたち)"],
	},
	例 => {
	    一 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	    二 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	},
    },
    日本 => {
	平仮名 => [qw(にっぽん にほん)],
	英 => {
	    0 => [qw(Japan)],
	},
	例 => {
	    一 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	    二 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	},
    },
    本日 => {
	平仮名 => [qw(ほんじつ)],
	英 => {
	    0 => [qw(today)],
	},
	例 => {
	    一 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	    二 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	},
    },
    平日 => {
	平仮名 => [qw(へいじつ)],
	英 => {
	    0 => [qw(weekday)],
	},
	例 => {
	    一 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	    二 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
	},
    },
    日月 => {
	平仮名 => [qw(じつげつ)],
	英 => {
	    0 => ["sun and moon", "time", "days", "years"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
        },
    },
    土日 => {
	平仮名 => [qw(どにち)],
	英 => {
	    0 => ["Saturday and Sunday", "weekend"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    日時計 => {
	平仮名 => [qw(ひどけい)],
	英 => {
	    0 => ["sundial"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    日の出 => {
	平仮名 => [qw(ひので)],
	英 => {
	    0 => ["sunrise"],
	},
        例 => {
	    一 => {
		日 => "初日の出",
		平 => "はつひので",
		英 => "first sunrise (of the New Year)",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    日の入り => {
	平仮名 => [qw(ひのいり)],
	英 => {
	    0 => ["sunset"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    朝日 => {
	平仮名 => [qw(あさひ)],
	英 => {
	    0 => ["morning sun"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    朝日影 => {
	平仮名 => [qw(あさひかげ)],
	英 => {
	    0 => ["morning sunlight"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    日々 => {
	平仮名 => [qw(ひび にちにち)],
	英 => {
	    0 => ["every day", "daily", "day after day", "(good old) days"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    日に日に => {
	平仮名 => [qw(ひにひに)],
	英 => {
	    1 => ["day by day", "by the day"],
	    2 => ["(arch) daily", "(arch) every day"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    三日前 => {
	平仮名 => [qw(さんにちまえ)],
	英 => {
	    0 => ["three days ago"],
	},
        例 => {
	    一 => {
		日 => "三日前、トムは去った。",
		平 => "さんにちまえ、とむはさった。",
		英 => "Tom left three days ago.",
	    },
	    二 => {
		日 => "三日前、旧友にひょっこり会った。",
		平 => "さんにちまえ、きゅうゆうにひょっこりあった。",
		英 => "I ran into an old friend three days ago.",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    十月十日 => {
	平仮名 => [qw(とつきとおか)],
	英 => {
	    1 => ["babies born on October 10", "supposedly conceived on New Year's Day"],
	    2 => ["normal gestation time (i.e. 9 months)"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    日曜日 => {
	平仮名 => [qw(にちようび)],
	英 => {
	    0 => ["Sunday"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    誕生日 => {
	平仮名 => [qw(たんじょうび)],
	英 => {
	    0 => ["birthday"],
	},
        例 => {
	    一 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    二 => {
		日 => "",
		平 => "",
		英 => "",
	    },
	    三 => {
	       日 => "",
	       平 => "",
	       英 => "",
	    },
        },
    },
    今日 => {
    	平仮名 => [qw(きょう こんにち こんじつ)],
    	英 => {
	    0 => ["today", "this day"],
	},
        例 => {
    	    一 => {
    		日 => "",
    		平 => "",
    		英 => "",
    	    },
    	    二 => {
    		日 => "",
    		平 => "",
    		英 => "",
    	    },
    	    三 => {
    	       日 => "",
    	       平 => "",
    	       英 => "",
    	    },
        },
    },
    明日 => {
    	平仮名 => [qw(あした あす みょうにち)],
    	英 => {
	    0 => ["tomorrow"],
	},
        例 => {
    	    一 => {
    		日 => "",
    		平 => "",
    		英 => "",
    	    },
    	    二 => {
    		日 => "",
    		平 => "",
    		英 => "",
    	    },
    	    三 => {
    	       日 => "",
    	       平 => "",
    	       英 => "",
    	    },
        },
    },
    昨日 => {
    	平仮名 => [qw(きのう さくじつ)],
    	英 => {
	    0 => ["yesterday"],
	},
        例 => {
    	    一 => {
    		日 => "",
    		平 => "",
    		英 => "",
    	    },
    	    二 => {
    		日 => "",
    		平 => "",
    		英 => "",
    	    },
    	    三 => {
    	       日 => "",
    	       平 => "",
    	       英 => "",
    	    },
        },
    },
    #  => {
    # 	平仮名 => [qw()],
    # 	英 => {
    # 	    0 => [""],
    # 	},
    #     例 => {
    # 	    一 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    二 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    三 => {
    # 	       日 => "",
    # 	       平 => "",
    # 	       英 => "",
    # 	    },
    #     },
    # },
    #  => {
    # 	平仮名 => [qw()],
    # 	英 => {
    # 	    0 => [""],
    # 	},
    #     例 => {
    # 	    一 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    二 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    三 => {
    # 	       日 => "",
    # 	       平 => "",
    # 	       英 => "",
    # 	    },
    #     },
    # },
    #  => {
    # 	平仮名 => [qw()],
    # 	英 => {
    # 	    0 => [""],
    # 	},
    #     例 => {
    # 	    一 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    二 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    三 => {
    # 	       日 => "",
    # 	       平 => "",
    # 	       英 => "",
    # 	    },
    #     },
    # },
    #  => {
    # 	平仮名 => [qw()],
    # 	英 => {
    # 	    0 => [""],
    # 	},
    #     例 => {
    # 	    一 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    二 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    三 => {
    # 	       日 => "",
    # 	       平 => "",
    # 	       英 => "",
    # 	    },
    #     },
    # },
    #  => {
    # 	平仮名 => [qw()],
    # 	英 => {
    # 	    0 => [""],
    # 	},
    #     例 => {
    # 	    一 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    二 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    三 => {
    # 	       日 => "",
    # 	       平 => "",
    # 	       英 => "",
    # 	    },
    #     },
    # },
    #  => {
    # 	平仮名 => [qw()],
    # 	英 => {
    # 	    0 => [""],
    # 	},
    #     例 => {
    # 	    一 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    二 => {
    # 		日 => "",
    # 		平 => "",
    # 		英 => "",
    # 	    },
    # 	    三 => {
    # 	       日 => "",
    # 	       平 => "",
    # 	       英 => "",
    # 	    },
    #     },
    # },
    );

1;
